; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v12 ?v13)
             (pred_5 ?v8 ?v5)
             (pred_11 ?v12 ?v5)
             (pred_4 ?v4 ?v12 )
	     (pred_8 ?v12)
             (pred_3 ?v11)
             (pred_2 ?v8)
             (pred_7 ?v5)
             (pred_9 ?v12)
             (pred_1 ?v8)
             (pred_12 ?v12)
             (pred_6 ))



(:action op_1
:parameters (?v10 ?v7 ?v6 ?v1)
:precondition (and (pred_3 ?v10) (pred_3 ?v7) (pred_2 ?v6) (pred_7 ?v1)
          (pred_10 ?v10 ?v7) (pred_5 ?v6 ?v1)
                   (pred_11 ?v7 ?v1) (pred_8 ?v10) 
                   (pred_9 ?v7) (pred_1 ?v6))
:effect (and  (pred_12 ?v7) (not (pred_9 ?v7))))


(:action op_2
:parameters (?v10 ?v2)
:precondition (and (pred_3 ?v10) (pred_3 ?v2)
               (pred_8 ?v10) (pred_10 ?v10 ?v2) (pred_12 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v10))))

(:action op_5
:parameters (?v10 ?v6)
:precondition (and (pred_3 ?v10) (pred_2 ?v6) 
                  (pred_8 ?v10) (pred_4 ?v6 ?v10) (pred_6 ))
:effect (and (pred_1 ?v6)
   (not (pred_4 ?v6 ?v10)) (not (pred_6 ))))


(:action op_3
:parameters (?v10 ?v3 ?v9)
:precondition (and (pred_3 ?v10) (pred_2 ?v3) (pred_2 ?v9)
                  (pred_8 ?v10) (pred_1 ?v9) (pred_4 ?v3 ?v10))
:effect (and (pred_1 ?v3) (pred_4 ?v9 ?v10)
        (not (pred_1 ?v9)) (not (pred_4 ?v3 ?v10))))

(:action op_4
:parameters (?v10 ?v6)
:precondition (and (pred_3 ?v10) (pred_2 ?v6) 
                  (pred_8 ?v10) (pred_1 ?v6))
:effect (and (pred_6 ) (pred_4 ?v6 ?v10) (not (pred_1 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_24 obj_15 obj_21 obj_19 obj_16 obj_28 obj_11 obj_23 obj_01 obj_18 obj_03 obj_06 obj_22 obj_10 obj_08 obj_07 obj_25 obj_20 obj_17 obj_14 obj_30 obj_09 obj_32 obj_26 obj_27
    obj_04 obj_29 obj_12
    obj_05 obj_02 obj_31 obj_13
    )

    (:init
       (pred_6)

       (pred_3 obj_24)
       (pred_3 obj_15)
       (pred_3 obj_21)
       (pred_3 obj_19)
       (pred_3 obj_16)
       (pred_3 obj_28)
       (pred_3 obj_11)
       (pred_3 obj_23)
       (pred_3 obj_01)
       (pred_3 obj_18)
       (pred_3 obj_03)
       (pred_3 obj_06)
       (pred_3 obj_22)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_07)
       (pred_3 obj_25)
       (pred_3 obj_20)
       (pred_3 obj_17)
       (pred_3 obj_14)
       (pred_3 obj_30)
       (pred_3 obj_09)
       (pred_3 obj_32)
       (pred_3 obj_26)
       (pred_3 obj_27)
       (pred_7 obj_04)
       (pred_7 obj_29)
       (pred_7 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_31)
       (pred_2 obj_13)

       (pred_10 obj_24 obj_28)
       (pred_10 obj_24 obj_15)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_15 obj_21)
       (pred_10 obj_15 obj_24)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_15)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_28 obj_03)
       (pred_10 obj_28 obj_11)
       (pred_10 obj_28 obj_24)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_11 obj_23)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_28)
       (pred_10 obj_23 obj_22)
       (pred_10 obj_23 obj_01)
       (pred_10 obj_23 obj_21)
       (pred_10 obj_23 obj_11)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_01 obj_23)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_03 obj_07)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_28)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_06 obj_22)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_22 obj_20)
       (pred_10 obj_22 obj_10)
       (pred_10 obj_22 obj_23)
       (pred_10 obj_22 obj_06)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_22)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_07 obj_30)
       (pred_10 obj_07 obj_25)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_25 obj_09)
       (pred_10 obj_25 obj_20)
       (pred_10 obj_25 obj_06)
       (pred_10 obj_25 obj_07)
       (pred_10 obj_20 obj_32)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_22)
       (pred_10 obj_20 obj_25)
       (pred_10 obj_17 obj_26)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_14 obj_27)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_30 obj_09)
       (pred_10 obj_30 obj_07)
       (pred_10 obj_09 obj_32)
       (pred_10 obj_09 obj_25)
       (pred_10 obj_09 obj_30)
       (pred_10 obj_32 obj_26)
       (pred_10 obj_32 obj_20)
       (pred_10 obj_32 obj_09)
       (pred_10 obj_26 obj_27)
       (pred_10 obj_26 obj_17)
       (pred_10 obj_26 obj_32)
       (pred_10 obj_27 obj_14)
       (pred_10 obj_27 obj_26)
       (pred_9 obj_25)
       (pred_9 obj_14)
       (pred_9 obj_26)
       (pred_9 obj_15)
       (pred_11  obj_25 obj_04)
       (pred_11  obj_14 obj_29)
       (pred_11  obj_26 obj_12)
       (pred_11  obj_15 obj_29)
       (pred_12 obj_24)
       (pred_12 obj_21)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_28)
       (pred_12 obj_11)
       (pred_12 obj_23)
       (pred_12 obj_01)
       (pred_12 obj_18)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_22)
       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_30)
       (pred_12 obj_09)
       (pred_12 obj_32)
       (pred_12 obj_27)

       (pred_5  obj_05 obj_04)
       (pred_5  obj_02 obj_29)
       (pred_5  obj_31 obj_12)
       (pred_5  obj_13 obj_29)
       (pred_4 obj_05 obj_23)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_31 obj_08)
       (pred_4 obj_13 obj_21)
       (pred_8 obj_32)
    )

    (:goal (and
       (pred_4 obj_05 obj_22)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_31 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_10)))
)
)

; plan
1. (op_2 obj_32 obj_20)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_20)
   goals met: 0 of 3
2. (op_2 obj_20 obj_22)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_22)
   goals met: 0 of 3
3. (op_2 obj_22 obj_23)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_23)
   goals met: 0 of 3
4. (op_5 obj_23 obj_05)
   deleted: (pred_4 obj_05 obj_23) (pred_6)
   added: (pred_1 obj_05)
   goals met: 0 of 3
5. (op_2 obj_23 obj_22)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_22)
   goals met: 0 of 3
6. (op_4 obj_22 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_6) (pred_4 obj_05 obj_22)
   goals met: 1 of 3
7. (op_2 obj_22 obj_06)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_06)
   goals met: 1 of 3
8. (op_2 obj_06 obj_11)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_11)
   goals met: 1 of 3
9. (op_2 obj_11 obj_23)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_23)
   goals met: 1 of 3
10. (op_2 obj_23 obj_01)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_01)
   goals met: 1 of 3
11. (op_2 obj_01 obj_18)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_18)
   goals met: 1 of 3
12. (op_2 obj_18 obj_08)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_08)
   goals met: 1 of 3
13. (op_5 obj_08 obj_31)
   deleted: (pred_4 obj_31 obj_08) (pred_6)
   added: (pred_1 obj_31)
   goals met: 1 of 3
14. (op_2 obj_08 obj_18)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_18)
   goals met: 1 of 3
15. (op_2 obj_18 obj_01)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_01)
   goals met: 1 of 3
16. (op_2 obj_01 obj_23)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_23)
   goals met: 1 of 3
17. (op_2 obj_23 obj_22)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_22)
   goals met: 1 of 3
18. (op_2 obj_22 obj_06)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_06)
   goals met: 1 of 3
19. (op_4 obj_06 obj_31)
   deleted: (pred_1 obj_31)
   added: (pred_6) (pred_4 obj_31 obj_06)
   goals met: 2 of 3
20. (op_2 obj_06 obj_22)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_22)
   goals met: 2 of 3
21. (op_2 obj_22 obj_20)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_20)
   goals met: 2 of 3
22. (op_5 obj_20 obj_02)
   deleted: (pred_4 obj_02 obj_20) (pred_6)
   added: (pred_1 obj_02)
   goals met: 2 of 3
23. (op_2 obj_20 obj_22)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_22)
   goals met: 2 of 3
24. (op_2 obj_22 obj_23)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_23)
   goals met: 2 of 3
25. (op_2 obj_23 obj_11)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_11)
   goals met: 2 of 3
26. (op_2 obj_11 obj_28)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_28)
   goals met: 2 of 3
27. (op_4 obj_28 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_6) (pred_4 obj_02 obj_28)
   goals met: 3 of 3
